Revit 2027 API
ExtrusionRoof.CurtainGrids Property
Retrieve all the CurtainGrid objects of a curtain Roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainGridSet CurtainGrids { get; }
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
member CurtainGrids : CurtainGridSet with get
Property Value
CurtainGridSet
Remarks
Only when the object is a CurtainRoof, this property makes sense.
See Also
Reference
ExtrusionRoof Class
Autodesk.Revit.DB Namespace